In [1]:
import pandas as pd

df = pd.read_parquet('/Users/fangsiyu/Desktop/movie_recommender/temp_data/movie_link_metadata.parquet')

In [8]:
df[['genres_tmdb']].head(10)

                                         genres_tmdb
0  [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
1  [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
2  [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
3  [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
4                     [{'id': 35, 'name': 'Comedy'}]
5  [{'id': 28, 'name': 'Action'}, {'id': 80, 'nam...
6  [{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...
7  [{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...
8  [{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...
9  [{'id': 12, 'name': 'Adventure'}, {'id': 28, '...

In [9]:
df[['original_language']].head(10)

  original_language
0                en
1                en
2                en
3                en
4                en
5                en
6                en
7                en
8                en
9                en

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27278 entries, 0 to 27277
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movieId            27278 non-null  int64
 1   title_ml           27278 non-null  object
 2   genres_ml          27278 non-null  object
 3   tmdbId             27026 non-null  float64
 4   genres_tmdb        26913 non-null  object
 5   id                 26913 non-null  float64
 6   original_language  26910 non-null  object
 7   overview           26641 non-null  object
 8   release_date       26886 non-null  object
 9   runtime            26855 non-null  float64
 10  title_tmdb         26912 non-null  object
dtypes: float64(3), int64(1), object(7)
memory usage: 2.3+ MB